---
title: CurtainCell
classe: Autodesk.Revit.DB.CurtainCell
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# CurtainCell

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `CurveArrArray CurveLoops { get; }` | `curtainCell.CurveLoops` | CurveArrArray |
| `CurveArrArray PlanarizedCurveLoops { get; }` | `curtainCell.PlanarizedCurveLoops` | CurveArrArray |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```